app/controllers/api/v1/articles_controller.rb

INSERT INTO `articles` (`title`, `body`, `blog_id`, `created_at`, `updated_at`) VALUES ('My grand father designed the lions in Trafalgar Square', 'It doesnt sound very cutting edge now, but at the time it really put the cat amongst the pigeons.', 1, '2015-05-04 13:32:37', '2015-05-04 13:32:37')
---
      def create
        begin
          article = Article.create!(article_params)

UPDATE `articles` SET `title` = 'My grand father designed the lions in Trafalgar Square', `body` = 'It doesnt sound very cutting edge now, but at the time it really put the cat amongst the pigeons.', `updated_at` = '2015-05-04 08:28:56' WHERE `articles`.`id` = 138
---
      def update
        @article = Article.update(params[:id], article_params)

DELETE FROM `articles` WHERE `articles`.`id` = 122
---
      def destroy
        respond_with Article.delete(params[:id])