app/controllers/api/v1/comments_controller.rb

SELECT `comments`.* FROM `comments`
---
      def index

        if (params['article_id'])
          @comments = Comment.where('article_id = ?', params['article_id'])
        else
          @comments = Comment.all